/* The string for canceling a map editing function. */
"CancelKey" = "Peruuta";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Haluatko varmasti peruuttaa?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "Muutoksiasi ei tallenneta.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "Luomaasi objektia ei tallenneta.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Hylkää muutokset";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Peruuta muokkaus";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Virheellinen osoite";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "Osoite on sisällytettävä pistettä varten";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "Et ole lisännyt sijaintia tätä pistettä varten";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "Uutta pistettä ei lisätä";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "Jatka muokkausta";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Valitse piste, jonka haluat poistaa.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "Poistettavia pisteitä ei ole.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "OK";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Haluatko varmasti tyhjentää kaikki pisteet?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "Ei";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Kyllä";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Haluatko vaihtaa pisteeseen?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Haluatko vaihtaa murtoviivaan?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Haluatko vaihtaa monikulmioon?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "Lisäämiäsi pisteitä ei muuteta, ja voit jatkaa objektin luontia";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "Kaikki lisäämäsi pisteet poistetaan";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Haluatko varmasti poistaa tämän pisteen?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Tallenna";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Suodata";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Nykyinen sijainti";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "Ehdotuksia ei löytynyt";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Osoite";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Tyhjennä kaikki";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ - luonti onnistui";

/* The placeholder text of the Searchbar */
"SearchKey" = "Hae";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Lisää uusi piste";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Peruskartta";

/* The title for the standard map type. */
"StandardKey" = "Standardi";

/* The title for the hybrid map type. */
"HybridKey" = "Hybridi";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Hybridi-Flyover";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Muted Standard";

/* The title for the satellite map type. */
"SatelliteKey" = "Satelliitti";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Satelliitti-Flyover";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Lisää sijainti";

